In [ ]:
!apt-get install openjdk-8-jdk-headless -qq > /dev/null
!wget -q https://archive.apache.org/dist/spark/spark-3.0.0/spark-3.0.0-bin-hadoop3.2.tgz
!tar -xvf spark-3.0.0-bin-hadoop3.2.tgz

In [5]:
import os
os.environ["JAVA_HOME"] = "/usr/lib/jvm/java-8-openjdk-amd64"
os.environ["SPARK_HOME"] = "/content/spark-3.0.0-bin-hadoop3.2"

In [4]:
!pip install -q findspark

In [6]:
# tornar o pyspark "importável"
import findspark
findspark.init('spark-3.0.0-bin-hadoop3.2')

In [15]:
%time 
# importando as bibliotecas"
#from com.crealytics.spark.excel import *
import pandas
from pyspark import SparkContext, SparkConf
from pyspark.sql import SQLContext, SparkSession
from pyspark.streaming import StreamingContext
from pyspark.sql.types import StructType, StructField, DoubleType, IntegerType, StringType

CPU times: user 4 µs, sys: 0 ns, total: 4 µs
Wall time: 8.11 µs

In [12]:
%time 
# setandos as variáveis"
ss = SparkSession.builder.master("local[*]").getOrCreate()
sc = SparkContext.getOrCreate(SparkConf().setMaster("local[*]"))
sql_sc = SQLContext(sc)
ssc = StreamingContext(sc, 2)

CPU times: user 3 µs, sys: 1 µs, total: 4 µs
Wall time: 7.39 µs

# ler excel

In [22]:
pdf = pandas.read_excel('/content/sample_data/p1.xlsx')
df = ss.createDataFrame(pdf)
df.show()

+--------+-------+
|    NOME|SALARIO|
+--------+-------+
|    JOAO|      2|
|   MARIA|    365|
| CARLOS |    555|
|   PEDRO|  55558|
|    LAIS|   2255|
|CORALINE|    555|
+--------+-------+

In [23]:
df.describe().toPandas().transpose()

             0                  1                   2        3      4
summary  count               mean              stddev      min    max
NOME         6               None                None  CARLOS   PEDRO
SALARIO      6  9881.666666666666  22390.362441610156        2  55558